Terraform Plan:

```
grafana_folder.test_folder1: Refreshing state... [id=0:31]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # grafana_folder.folder1 will be created
  + resource "grafana_folder" "folder1" {
      + id                           = (known after apply)
      + prevent_destroy_if_not_empty = false
      + title                        = "TerraformManaged"
      + uid                          = (known after apply)
      + url                          = (known after apply)
    }

  # grafana_folder.test_folder1 will be destroyed
  # (because grafana_folder.test_folder1 is not in configuration)
  - resource "grafana_folder" "test_folder1" {
      - id                           = "0:31" -> null
      - org_id                       = "0" -> null
      - prevent_destroy_if_not_empty = false -> null
      - title                        = "Test_Folder 1" -> null
      - uid                          = "fdc6vjn2xeiv4c" -> null
      - url                          = "https://grafana09ca.grafana.net/dashboards/f/fdc6vjn2xeiv4c/test-folder-1" -> null
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

Plan saved to GH artifacts.